Задание 10.
Какие классы из текущего проекта вы можете взять в следующий проект?

Из текущего проекта в следующий видется возможным импортировать только модуль DateTime.
Этот модуль представляет функционал для простой и удобной работы с датой/временем.
Представление даты в формате вещественного числа убирает необходимость в использовании строк
или сложных типов д
анных (структур), а также заметно упрощает работу с редактированием дат.
Остальные модули узконаправлены и не подходят для широкого применения.