'''
1. Наследование подтипов (subtype inheritance).
Пусть существует некий родительский класс «кочевники». И от него выделим следующие подтипы: «печенеги» и «половцы».
У них будут общие методы (например, миграция, набеги на Русь, скотоводство и пр.), но при этом будет и ряд собственных
уникальных методов, присущих исключительно этим двум племенам (например, различные обычаи и пр.).
2. Наследование с ограничением (restriction inheritance).
К примеру, животный мир. Возьмём подтип «Позвоночные» и его класс-потомок «Рыбы». В данном случае класс «Рыбы» ограничен
единственным ареалом обитания «вода», в отличие от других классов, которые могут пребывать и даже охотиться в другой
среде.
3. Наследование с расширением (extension inheritance).
Возьмём за основу средневековую аристократию. Предположим, родительским классом будет «Аристократ». Тогда возможно
создать цепочку иерархии:
 «Аристократ»     «Барон»      «Виконт»      «Граф»      «Маркиз»      «Герцог»
Каждый из этих титулов является продолжением предыдущего с более расширенными полномочиями.
'''