Шаг 1. Определяем границы разрабатываемой системы (анализ):

- что будет включено в систему, а что точно не надо в неё включать;
- главные подсистемы;
- пользовательские метафоры;
- функциональность;
- библиотеки повторного использования.

Задание 2.

Выполните этот шаг без детализации, по 3-7 ключевых понятий в компактной формулировке по каждому пункту.


Что будет включено в систему:
- Манипуляции с сущностью дата/время.
- Сохранение пользовательских событий.
- Вывод оповещений о наступлении запланированного события.
- Аналитика расходов пользователя.
Что не будет включено в систему:
- Контакты (пользовательская адресная-телефонная книга)
- Записная книжка и листики-заметки для сохранения общей личной информации.
- Планировщик задач для контроля их выполнения.

Главные подсистемы:
- Будильник
- Секундомер
- Таймер
- Календарь
- Анализатор расходов.

Пользовательские метафоры:
- Чекпоинт - точка остановки для отображения промежуточных результатов секундомера.
- Календарь - модуль для отображения/создания пользовательский событий.
- Памятка/Напоминалка - пользовательское событие, привязанное к конкретной дате/времени.

Функциональность:
- Старт/пауза/остановка подсчёта времени между двумя времеными точками.
- Отсчёт определённого кол-ва времени.
- Установка напоминаний на определённое время (будильник) и дату (календарь).
- Анализ пользовательских расходов.

Библиотеки повторного использования:
- Сущность Дата/время может быть использована в описании процессов растянутых во времени.
- Таймер и напоминания могут использоваться для ограничения выполнения процессов, мониторинга времени выполнения.