Задание 4. Подумайте, потребуются ли вам в проекте специфические структуры данных
(например, какие-то особенные способы хранения объектов), поддерживающие и организующие
работу с классами анализа, или достаточно будет обойтись возможностями стандартных библиотек.

Выделите при необходимости основные классы реализации (АТД) в проекте -- только на
уровне их названий (на английском) и краткого описания в несколько слов (на русском).


Классы реализации:

В качестве хранилища будет использована база данных SQLite (модуль sqlite3).
Воспроизведение звука обеспечит модуль звукового сопровождения playsound.
